[
  {
    "id": "reddit_1m0y5an",
    "text": "Japanese E-10 bullet trains to run on Mumbai-Ahmedabad corridor ",
    "created_at": "2025-07-16T00:09:44+00:00",
    "source": "reddit",
    "location": "Mumbai, Maharashtra",
    "url": "https://reddit.com/r/india/comments/1m0y5an/japanese_e10_bullet_trains_to_run_on/",
    "score": 66,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3d2r8h",
    "text": "Exactly the way to spend money in our country. Rich gujaratis need to travel in luxury - Rest of the country can go to hell.\n\nModi laid the seed for india's dissolution with looting the south to funnel it into gujarat, UP/Bihar. Its all about elections\n\nonly state in the south getting funds now is andhra as Modi is dependent on them for majority - he gave jackshit until he lost his majority. So everything is about politics for this crook - Modi above India - and bhakts lap it up.\n\nIts a fact - gujarat got the lionshare of all projects in the last 10 years - this is digusting - he is pM of gujarat not India",
    "created_at": "2025-07-16T00:35:06+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m0y5an/japanese_e10_bullet_trains_to_run_on/",
    "score": 63,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.125,
      "label": "positive",
      "confidence": 0.625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eeg5j",
    "text": "Sure, cancel planned regional VBE for giving more trains to Mumbai.",
    "created_at": "2025-07-16T05:56:02+00:00",
    "source": "reddit_comment",
    "location": "Mumbai, Maharashtra",
    "url": "https://reddit.com/r/india/comments/1m0y5an/japanese_e10_bullet_trains_to_run_on/",
    "score": 0,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.5,
      "label": "positive",
      "confidence": 1.0
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3d53wb",
    "text": "I'm not sure why they don't stick to VBE and just make it better...",
    "created_at": "2025-07-16T00:48:38+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m0y5an/japanese_e10_bullet_trains_to_run_on/",
    "score": -14,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.125,
      "label": "positive",
      "confidence": 0.625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1b9jg",
    "text": "I lost my first mobile phone in a bus I'm a new student in Kolkata shifted recently here . from the last 2-3 days I was travelling in bus to go and come from my college . So today as regular I go I took a  bus for my college and it was very crowded, but after some time It reduced to an extent and I got a seat along with my friend and my phone was constantly in my hand , but as our stoppage came he had to stand up and go so I put my phone in my pocket and proceed to move , while the stoppage came closer more and more people came near the bus gate and I thought all were same university students , just after I stepped down and the bus started moving , I put my hands in my pocket and see there's nothing that made me super super nervous and from my friend phone I called my number immediately but it was switched off . Immediately I rushed to the nearest police station and complaint a fir but I don't think I could find my phone anymore I tried everything like google find my phone and stuff but nothing works I think they formatted the phone as the emails where also logged out . I did block my number immediately but . Still it meant a lot to me as it was my first phone which I was recently gifted by my parents. \nIf anyone could help me it would be a a hugee help . \nAnd to all the people watching this pls be safe. ",
    "created_at": "2025-07-16T12:27:33+00:00",
    "source": "reddit",
    "location": "Kolkata, West Bengal",
    "url": "https://reddit.com/r/india/comments/1m1b9jg/i_lost_my_first_mobile_phone_in_a_bus/",
    "score": 14,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.17485970819304153,
      "label": "positive",
      "confidence": 0.6748597081930415
    },
    "transport_type": "bus",
    "state": "West Bengal"
  },
  {
    "id": "reddit_comment_n3gwb9y",
    "text": "Hi which route ? Would be helpful. \n\n\nI know that they operate along the EM Bypass and Khidirpore sections. \n\n\nAlso in New Town I have heard they cut your skin with a blade and flick your phone when you are in shock. ",
    "created_at": "2025-07-16T16:31:03+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m1b9jg/i_lost_my_first_mobile_phone_in_a_bus/",
    "score": 1,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.13636363636363635,
      "label": "positive",
      "confidence": 0.6363636363636364
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3hi5nl",
    "text": "Advice is in the end, this is my story.\n\nI can understand you. My phone was stolen in August 2023. It was my first phone, used by my mom and then handed down to me. It was worth next to nothing, but I was really attached to it.\n\nThe theft didn’t happen in my home district. The police there even refused to register an FIR and just asked me to submit an “application.” I did, but nothing happened. I also submitted a block request on CEIR myself, nothing again.\n\nMy parents contacted someone in the police from our home district. As he advised, they reported the phone as “Lost in our home district\" and informed him later. (not sure if FIR or criminal activity was registered)\n\nAfter 3 months of no updates, i lost hope.\n\nThen last month, my mom sent me a photo from the police station. It showed that my phone had been activated. Their system displayed the name and address of the person whose SIM was inserted. He was from the adjacent district to where my phone had been stolen. That guy finally switched it on after more than 1.5 years.\n\nWe contacted the person and he denied everything and the number is switched off ever since. We'll be taking further action.\n\nADVICE: \nStrictly from my experience, police from outside your home district or state will be of less assistance. Register the complaint in your home police station and its better if you know someone there. Waiting is all you can do after that. Don't get your hopes up too high. From what i heard, the cautious ones just dismantle the phone and sell untraceable components.\n\nADVICE for NEW PHONE so that the thief can do nothing till the battery lasts(these have their inconveniences but are foolproof):\nTurn on \"password for switch off'.\nTurn off the access to the notification bar when the phone is locked so the thief can't turn off mobile data and gps.\nBuy an e-sim mobile, the thief can't remove sim to turn data off and tracing the phone is very easy by find my phone or through police(Above two are still useful if you can't buy e-sim phone)\n\nI still do hope you get your phone back.",
    "created_at": "2025-07-16T18:10:21+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m1b9jg/i_lost_my_first_mobile_phone_in_a_bus/",
    "score": 1,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.06249890206411946,
      "label": "neutral",
      "confidence": 0.5624989020641195
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m15rtd",
    "text": "Is Reservation really working on equality? I was a Neet aspirant and that was what made me dig deep into the reservation systems in India.\nI've seen the kind of quotas given to certain socially and economically hindered parts of the Society, Well That is the sole purpose of given reservation. It is to bring development and give them a fresh start to live without issues.\n\nWhat made me post this was a small incident that took place today morning. I woke up late being tired the previous night, I heard a few dhol and drums beating and I went out to see what the matter was. I saw a group of people with dhols and drums in their hand, going every house they see by and collecting whatever was given.\nNot surprising they entered our house and started playing the same beats. \nI was fortunate enough to strike a conversation with them regarding their lifestyle, food etc etc...\nI gave them a nominal amount.\nAs they went away, I struck my mind that It is there people whom we are giving the reservation in the central and state posts and exams.Belonging to the general, we are mentally trained to fight solely with merit.\nHow right is it for me to give them a lending hand and support the venture that they were doing today,?! \nThe reservation they get has the potential to get them to very high levels and ofcourse make a displacement reaction.\nInorder to stop all these,(discrimination ), we need to think rationally and stop entertaining the activities based on past and follow the legal path.\nI could be totally wrong in this matter ,,if so please give your 2 cents.\nAspiring to make a stronger India.",
    "created_at": "2025-07-16T06:55:28+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m15rtd/is_reservation_really_working_on_equality/",
    "score": 0,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.017230674087816953,
      "label": "neutral",
      "confidence": 0.517230674087817
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eokiw",
    "text": "I get what you're saying. But most of the people you saw today won’t even make it near a NEET form. Their fight starts way earlier, bad schools, no guidance, daily survival.\n\nReservation isn’t a shortcut. It’s just a chance to be in the race.\n\nYeah, the system needs fixing. But removing it altogether won’t level the field it’ll just hide the gaps.",
    "created_at": "2025-07-16T07:27:20+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m15rtd/is_reservation_really_working_on_equality/",
    "score": 15,
    "subreddit": "india",
    "sentiment": {
      "polarity": -0.019999999999999973,
      "label": "neutral",
      "confidence": 0.52
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3f6mhc",
    "text": "Another nice general guy with good intention, just want to know the system better.\n\nNo hidden agenda here. He is here just to learn and won't be arguing with you when you will explain need for reservation.",
    "created_at": "2025-07-16T10:19:36+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m15rtd/is_reservation_really_working_on_equality/",
    "score": 7,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.38666666666666666,
      "label": "positive",
      "confidence": 0.8866666666666667
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g8rrq",
    "text": "The real problem in India is not enough opportunities being added as our population has grown.\n\nLet me give you an example - like you said you're a NEET aspirant, so according to WHO the bottom most ratio of doctors vs population is supposed to be 1:1000 but in India we've it at 1:1300 roughly.\n\nSo, government's first priority should be to invest in healthcare to create Government Medical Colleges which in turn increase the number of doctors. Now, someone might ask why not private colleges/hospitals. So, anyone knows that it's 30 lakhs max in a Government college while private colleges cost 1Cr+ in fees. And we know the latter isn't affordable to most of the Indians.\n\nHence, government wants you to focus on asking the question on reservations but not on the investment in healthcare which can create more opportunities. And the population constantly fights in between themselves while the politicians keep doing their drama.",
    "created_at": "2025-07-16T14:19:07+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/india/comments/1m15rtd/is_reservation_really_working_on_equality/",
    "score": 1,
    "subreddit": "india",
    "sentiment": {
      "polarity": 0.1576923076923077,
      "label": "positive",
      "confidence": 0.6576923076923077
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1a92x",
    "text": "Aqua Line metro- Opening Helloo, I will be moving to Mumbai next month and I’ll be depending on the Aqua Line metro for travel. When will the Cuffe Parade stations become operational? The official date announced as of now is August 2025, is this likely? Any idea what the progress is? Please help out! ",
    "created_at": "2025-07-16T11:36:45+00:00",
    "source": "reddit",
    "location": "Mumbai, Maharashtra",
    "url": "https://reddit.com/r/mumbai/comments/1m1a92x/aqua_line_metro_opening/",
    "score": 1,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": -0.08333333333333333,
      "label": "neutral",
      "confidence": 0.5833333333333334
    },
    "transport_type": "metro",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3h5ktt",
    "text": "I don't know when it will open, but I am confident it won't be the date these idiots have planned, it will be late. \n\n\nMost likely much later, and when it's finally ready, we won't be able to use it for 2 month's because some important person has to inaugurate it. ",
    "created_at": "2025-07-16T17:14:06+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/mumbai/comments/1m1a92x/aqua_line_metro_opening/",
    "score": 1,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": 0.09999999999999999,
      "label": "neutral",
      "confidence": 0.6
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1gnh5",
    "text": "Manhole/Sewage cover keeps getting tapped by road traffic on the opposite street Few weeks ago, the road adjacent to my society got pulverized & made full concrete. In the process, the old covers were removed & new covers were installed with new hinges, works etc.\nNow, following the complaint,1st time the covers got tapped, someone from BMC came around and used tar to fill the air/ structural gaps, but rains washed the adhesive away.\n\nAnyone has leads on how to get BMC to resolve this for good, otherwise a temporary solution isn't going to be worth looking into.\n\nI'm in Oshiwara, Andheri(W). Can get my society & ones in the vicinity to sign off on a letter with video footage confirming the issue.",
    "created_at": "2025-07-16T16:04:26+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/mumbai/comments/1m1gnh5/manholesewage_cover_keeps_getting_tapped_by_road/",
    "score": 1,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": 0.16727272727272727,
      "label": "positive",
      "confidence": 0.6672727272727272
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1g2d6",
    "text": "Auto walas : The gift that keeps on giving The amount of times I've had frustrating, hair pulling arguments or experiences with auto walas is way too high. As I drive my car most of the times to get anywhere, these guys think they own the road. Getting into gaps that don't exist(senna would be proud), argue back and no sense of general civility. They stare back as if we're wrong to question them.\nToday, an auto wala stopped in the middle - dead centre of a 2 lane road on the dividing line to pick up a passenger. I pulled up next to him and here is how it went - \n\nIncident 1\nMe : Bhai kaha rok raha hai. Dekh toh. Side pe nahi rok sakta\nAuto wala: kya hogaya. Toh kaha roku\nMe : side pe yaar\nAutowala : rok liya toh rok liya\nMe(pulled up in front of his lane) ; toh mein yaha rok lu? Chalega?\nAuto wala: ha rok lo\nI wish I could be that useless and unbothered\n \nIncident 2\nI was on a bike in heavy traffic\nAuto wala slowly drives over my leg and I reacted by hitting the auto as it was sudden and slightly painful.\nMe : bc dikhta nahi hai Mera pair hai\nAuto wala. Toh andar rakho\n\nI wish i could just slap the shit out of these people.  I have every reason to. I hate these rat driving people. \nSorry for the rant. But I hope people have the same shared experiences or I am just unlucky.",
    "created_at": "2025-07-16T15:44:57+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/mumbai/comments/1m1g2d6/auto_walas_the_gift_that_keeps_on_giving/",
    "score": 18,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": -0.10428571428571426,
      "label": "negative",
      "confidence": 0.6042857142857143
    },
    "transport_type": "auto",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gtep1",
    "text": "![gif](giphy|ynvmmnqi83vi6z3GnM|downsized)",
    "created_at": "2025-07-16T16:15:39+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/mumbai/comments/1m1g2d6/auto_walas_the_gift_that_keeps_on_giving/",
    "score": 6,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3h6j3v",
    "text": "Misleading title. Thought I was gonna read a praise ( propaganda post ) lol.",
    "created_at": "2025-07-16T17:18:20+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/mumbai/comments/1m1g2d6/auto_walas_the_gift_that_keeps_on_giving/",
    "score": 5,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": 0.35000000000000003,
      "label": "positive",
      "confidence": 0.8500000000000001
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3hr191",
    "text": "Just rise above, dude. Keep repeating this to yourself: \n\nThese vermin spend all day in their shitty matchboxes, too poor to afford a vehicle with doors. The only wins they ever get in their pathetic lives, are by driving rashly and wasting a few seconds for other people - who have much better things to do with their lives. They will never amount to anything.\n\n#And they deserve all of it.\n\nTake some comfort in their suffering. Because they certainly don't care about yours.\n\n*P.S. there are also plenty of good auto drivers, especially in Mumbai. And my heart goes out to them too. Good wishes to those who deserve it, and curses to those who don't.*",
    "created_at": "2025-07-16T18:51:22+00:00",
    "source": "reddit_comment",
    "location": "Mumbai, Maharashtra",
    "url": "https://reddit.com/r/mumbai/comments/1m1g2d6/auto_walas_the_gift_that_keeps_on_giving/",
    "score": 3,
    "subreddit": "mumbai",
    "sentiment": {
      "polarity": 0.05744047619047618,
      "label": "neutral",
      "confidence": 0.5574404761904762
    },
    "transport_type": "auto",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_1m170kw",
    "text": "metro card keeps cutting money the new metro cards the airtel ones keep cutting money randomly even when I don't go out at all, i just wanted to ask what the money cut is for??? ",
    "created_at": "2025-07-16T08:15:55+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m170kw/metro_card_keeps_cutting_money/",
    "score": 13,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": -0.3909090909090909,
      "label": "negative",
      "confidence": 0.8909090909090909
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3exusi",
    "text": "Might be previous transactions? I have noticed that airtel payment app deducts money from the card several days after I use the card.",
    "created_at": "2025-07-16T08:57:14+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m170kw/metro_card_keeps_cutting_money/",
    "score": 12,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": -0.08333333333333333,
      "label": "neutral",
      "confidence": 0.5833333333333334
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eumcx",
    "text": "Cut the metro card\n\n/s",
    "created_at": "2025-07-16T08:25:35+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m170kw/metro_card_keeps_cutting_money/",
    "score": 2,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ezori",
    "text": "Actually this happens with the fastag also\n\nYou will get notification a day or two after passing the toll plaza\n\nMaybe these are also previous transactions getting updated now",
    "created_at": "2025-07-16T09:14:58+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m170kw/metro_card_keeps_cutting_money/",
    "score": 2,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": -0.08333333333333333,
      "label": "neutral",
      "confidence": 0.5833333333333334
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1dih1",
    "text": "Some educated fellows in the metro While travelling from kashmere gate to Saket this is what happening 👀 in the metro matlab bhai thoda toh kasht dedo apne haathon ko ek  bottle bhaari pad gyi dustbin tak pahuchane mein😶\n",
    "created_at": "2025-07-16T14:07:02+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m1dih1/some_educated_fellows_in_the_metro/",
    "score": 20,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g8hql",
    "text": "Fir yhi log chillate hai ki Delhi kitti gandi ho gyi hai…smh!!",
    "created_at": "2025-07-16T14:17:45+00:00",
    "source": "reddit_comment",
    "location": "Delhi",
    "url": "https://reddit.com/r/delhi/comments/1m1dih1/some_educated_fellows_in_the_metro/",
    "score": 5,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Delhi"
  },
  {
    "id": "reddit_comment_n3hbtl1",
    "text": "Educated doesn’t mean civilised.",
    "created_at": "2025-07-16T17:41:53+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m1dih1/some_educated_fellows_in_the_metro/",
    "score": 1,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": -0.3125,
      "label": "negative",
      "confidence": 0.8125
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m19zvl",
    "text": "Found this at a metro station, but..... Expired nikla 😭😭",
    "created_at": "2025-07-16T11:22:48+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m19zvl/found_this_at_a_metro_station_but/",
    "score": 2,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gh27r",
    "text": "What? card expire bhi ho jata hai? 💀",
    "created_at": "2025-07-16T14:58:18+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m19zvl/found_this_at_a_metro_station_but/",
    "score": 2,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gourq",
    "text": "Expired or no money \n\n\nI have one since 2018 \nStill working \nLast time june me use kiya tha",
    "created_at": "2025-07-16T15:34:02+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/delhi/comments/1m19zvl/found_this_at_a_metro_station_but/",
    "score": 1,
    "subreddit": "delhi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m17s3a",
    "text": "Bus commuters, are you worried about traffic delays, and destination anxiety is not allowing you to sleep peacefully? use below feature to set location based alarms/reminders, you phone will remind you at your destination. **Saw an interesting post today — someone boarded a bus from KR Pura metro, fell asleep, and woke up 80 minutes later… only to find the bus was still stuck near Marathahalli. They were heading to Electronic City, I think.**\n\nBut what caught my attention was the number of people discussing ways to set **location-based reminders** on their phones — something that could **wake you up as you approach your stop**, so you don’t have to keep checking anxiously.\n\nA smart idea someone mentioned:  \nSet **two reminders** — one for your actual stop, and one for the stop just *before* it. That way, you get a heads-up and time to prepare.\n\nBelow are the steps to configure these location based reminders on almost any phone\n\nFor Android Users\n\n# Using Google Keep (Pre-installed on Many Devices)\n\n1. Open **Google Keep** app.\n2. Tap the **plus (+)** icon to add a new note.\n3. Write your reminder (e.g., “Wake up at Central Station”).\n4. Tap the **reminder (bell)** icon at the top.\n5. Select **Pick place** (or Location).\n6. Search for and select your desired location.\n7. Save the reminder.\n\nWhen you reach or approach the set location, your phone will notify you\n\n# For iPhone Users\n\n1. **Open the Reminders app.**\n2. Create a new reminder or tap an existing one.\n3. Tap the info (“i”) button next to the reminder.\n4. Enable **“Remind me at a location.”**\n5. Tap **Location** and search for, or enter, the address.\n6. Choose **Arriving** (as you get there) or **Leaving** (when you leave).\n7. Adjust the radius if needed to set how close you want to be before the reminder goes off.\n8. Tap **Done** to save your reminder.\n\nYou can also use Siri:  \nSay “Remind me to wake up when I get to \\[destination\\]” or “Remind me to get off the train at \\[station name\\].”",
    "created_at": "2025-07-16T09:07:05+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m17s3a/bus_commuters_are_you_worried_about_traffic/",
    "score": 11,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": 0.1669294990723562,
      "label": "positive",
      "confidence": 0.6669294990723562
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fce0d",
    "text": "Why so much!  \nGoogle maps -> public transport option will buzz your before your stop.",
    "created_at": "2025-07-16T11:06:54+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m17s3a/bus_commuters_are_you_worried_about_traffic/",
    "score": 3,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": 0.125,
      "label": "positive",
      "confidence": 0.625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1a9sq",
    "text": "Why are flyovers between Silk Board and Tin Factory getting blocked at night lately? Is it really Metro work or something else? Almost every other night, some part of the stretch between Silk Board and Tin Factory is blocked or diverted. Even after 10 PM, traffic piles up like it’s 6 PM.\n\nPeople are saying it’s due to Namma Metro construction, but there’s hardly any official communication or proper signs around. If Metro work is the reason shouldn’t they be planning better diversions or at least informing commuters?\n\nFlyovers are supposed to ease traffic not become choke points at night too.",
    "created_at": "2025-07-16T11:37:48+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1a9sq/why_are_flyovers_between_silk_board_and_tin/",
    "score": 59,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": -0.02023809523809524,
      "label": "neutral",
      "confidence": 0.5202380952380953
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fi1c0",
    "text": "You’re right to expect better instructions from the authorities but unfortunately no one cares. Most of ORR is closed at night for metro construction and road repairs and it’s a nightmare because there are very few alternate routes.\n\nI personally have given up on expecting proper signs or communication regarding such things. Even if I know the routes, I still keep Maps running to help with such situations.\n\nWe deserve better and I have tried asking authorities for this but no one ever responds or cares.",
    "created_at": "2025-07-16T11:47:44+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1a9sq/why_are_flyovers_between_silk_board_and_tin/",
    "score": 32,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": 0.13964285714285712,
      "label": "positive",
      "confidence": 0.6396428571428572
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fi6jf",
    "text": "Official reason is due to Metro construction, debris and material fly off and land on the road. \n\nSince the Traffic cops are probably not staffed enough to coordinate with Metro folks on which flyover they will be working on for a particular night, they just close everything. \n\nOne thing I have noticed is that if the flyover is open there is no drunk+drive checking. If it’s closed chances are the cops are checking below the flyovers. \n\nNot saying this is a bad thing, offenders need to be punished. Maybe it is a coincidence, but observed a few times.",
    "created_at": "2025-07-16T11:48:41+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1a9sq/why_are_flyovers_between_silk_board_and_tin/",
    "score": 16,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": -0.019791666666666645,
      "label": "neutral",
      "confidence": 0.5197916666666667
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fqzl8",
    "text": "Throwback to 2012, same circus, same clowns. What these junctions really need? **Tear down those ancient flyovers and slap up a massive cloverleaf interchange**. Yeah, it's gonna mean knocking down a bunch of properties .. so what? When the tax money from this part of Bengaluru is busy funding pointless temples, snake censuses, and statue fever in UP, MP, and Bihar, not to mention those iffy collapsible bridges, why the hell shouldn’t we prioritize ourselves?\n\nAny other “solution” would just be a glorified waste of cash and time .. traffic won’t budge an inch. Let’s stop pretending and build what actually works.",
    "created_at": "2025-07-16T12:44:06+00:00",
    "source": "reddit_comment",
    "location": "Bangalore, Karnataka",
    "url": "https://reddit.com/r/bangalore/comments/1m1a9sq/why_are_flyovers_between_silk_board_and_tin/",
    "score": 10,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": -0.07488425925925925,
      "label": "neutral",
      "confidence": 0.5748842592592592
    },
    "transport_type": "bus",
    "state": "Karnataka"
  },
  {
    "id": "reddit_1m1cx62",
    "text": "My Father lost his Phone & ATM Card in BUS Hi guys, \n\nMy father lost his phone and ATM card while on bus to Bangalore from hometown. Please help me how do I take this forward ? How do I block the ATM without phone(OTP). How to block & get new SIMs(Airtel & BSNL). I’m thinking to file a lost complaint online! Do I require to visit police station? And is the phone traceable? It’s a Vivo phone.\n\n#help\n",
    "created_at": "2025-07-16T13:42:22+00:00",
    "source": "reddit",
    "location": "Bangalore, Karnataka",
    "url": "https://reddit.com/r/bangalore/comments/1m1cx62/my_father_lost_his_phone_atm_card_in_bus/",
    "score": 5,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": -0.11931818181818182,
      "label": "negative",
      "confidence": 0.6193181818181819
    },
    "transport_type": "bus",
    "state": "Karnataka"
  },
  {
    "id": "reddit_comment_n3g2teo",
    "text": "For ATM, first try calling the bank's helpdesk, if that doesn't work go to the branch. For lost phone, visit Bus operators office Lost and found dept or ask if they can help in any way. Also make sure you register a lost phone report in the police station. The may try to find it, if not still it is necessary to register a complaint so that you are safe if there is any misuse of stolen phone.",
    "created_at": "2025-07-16T13:49:04+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1cx62/my_father_lost_his_phone_atm_card_in_bus/",
    "score": 3,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": 0.19,
      "label": "positive",
      "confidence": 0.69
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g1z36",
    "text": "Good luck finding it, some mf stole my phone almost an year ago, i filed a case still nothing. Someone might have probably stolen it. It's a land of thieves u can't do anything. Next time be carefull",
    "created_at": "2025-07-16T13:44:43+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1cx62/my_father_lost_his_phone_atm_card_in_bus/",
    "score": 2,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": 0.35,
      "label": "positive",
      "confidence": 0.85
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g628y",
    "text": "call bank customer care black atm card.. go to airtel/bsnl store take new sim same mobile number Rs 50 service start after 4 hrs file online complenit... block mobile device on ceir website... forget about getting back mobile... its gone",
    "created_at": "2025-07-16T14:05:40+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/bangalore/comments/1m1cx62/my_father_lost_his_phone_atm_card_in_bus/",
    "score": 2,
    "subreddit": "bangalore",
    "sentiment": {
      "polarity": -0.007575757575757576,
      "label": "neutral",
      "confidence": 0.5075757575757576
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1axlk",
    "text": "Help about bus timing Hey guys, Is there any direc bus is there from siruseri to broadway because I am booke a train for coimbatore which is scheduled to departure at 9pm, I will come out of office by 7pm if I departure from sirsuri in bus how many hrs will take to reach broadway or central? Will I get the train ? Help needed friends and chennai family ",
    "created_at": "2025-07-16T12:11:32+00:00",
    "source": "reddit",
    "location": "Chennai, Tamil Nadu",
    "url": "https://reddit.com/r/Chennai/comments/1m1axlk/help_about_bus_timing/",
    "score": 0,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.25,
      "label": "positive",
      "confidence": 0.75
    },
    "transport_type": "train",
    "state": "Tamil Nadu"
  },
  {
    "id": "reddit_comment_n3fm2v6",
    "text": "Bus number 102. \n\nDownload Chalo app to check the timings.",
    "created_at": "2025-07-16T12:14:01+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m1axlk/help_about_bus_timing/",
    "score": 2,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fmu3e",
    "text": "Nilgiris express?\nI leave from Velachery Grand Mall in auto at 7.30pm and reach that train by 8.50pm.\nReaching the train from Siruseri is impossible if you start at 7pm.",
    "created_at": "2025-07-16T12:18:47+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m1axlk/help_about_bus_timing/",
    "score": 2,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": -0.08333333333333331,
      "label": "neutral",
      "confidence": 0.5833333333333333
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fti76",
    "text": "Leave at least by 6pm.  You are very likely to miss the train if you leave at 7pm from Siruseri.  \n\nYou mean Central and not broadway.  Many buses going to broadway may not go via central station itself.  You may have to walk some distance  from the nearest stop",
    "created_at": "2025-07-16T12:58:26+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m1axlk/help_about_bus_timing/",
    "score": 1,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": -0.018750000000000006,
      "label": "neutral",
      "confidence": 0.51875
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_1m13yu4",
    "text": "Trichy Panjappur Kalaiagnar Karunanithi Integrated Bus Terminus started operating buses from today. Trichy Panjappur IBT \n\nPlatform 1\tBangalore\t- Bangalore, Tirupathi\n\nPlatform 2\tChennai\t - Chennai\n\nPlatform 3\tVillupuram sector - Villupuram, Vellore, Thiruvannamalai, Kanchipuram, Thiruthani, Pondy, Cuddalore, Neyveli\n\nPlatform 4\tKarur sector - Hosur, Salem, Namakkal, Erode, Musiri, Ooty, Coimbatore, Tiruppur, Karur\n\nPlatform 5\tMadurai\t sector- Madurai, Thiruchendur, Sivakasi, Kovilpatti, Thuvarankuruchi, PonAmaravathy, Cumbum, Theni, Pollachi, Palani, Dindigul, Manapparai\n\nPlatform 6\tPudukkottai sector - Rameshwaram, Ramanathapuram, Thondi, Devakottai, Paramakudi, Sivagangai, Thirupathur, Annavasal, Illupur, Pattukkottai, Aranthangi, Peravurani, Karaikudi\n\nPlatform 7\tThanjavur sector - Velanganni, Nagapattinam, Thiruvarur, Nagoor, Pattukkottai, Mannargudi, Vedaranyam, Thiruthuraipoondi, Chidambaram, Mayiladuthurai, Karaikal, Thanjavur\n\nPlatform 8\tThanjavur sector - Thanjavur, Kumbakonam",
    "created_at": "2025-07-16T05:04:33+00:00",
    "source": "reddit",
    "location": "Bangalore, Karnataka",
    "url": "https://reddit.com/r/Chennai/comments/1m13yu4/trichy_panjappur_kalaiagnar_karunanithi/",
    "score": 21,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Karnataka"
  },
  {
    "id": "reddit_comment_n3e9uqk",
    "text": "Enga irukku idhu trichy la?",
    "created_at": "2025-07-16T05:16:50+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m13yu4/trichy_panjappur_kalaiagnar_karunanithi/",
    "score": 3,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1br49",
    "text": "Chennai to Munnar - travel via public transport Vanakkam Makkaleh,\n\nI need your advice on travelling to Munnar in Public transport. I have searched in Google and it showed some option like going to Dindigul or Ernakulam and take bus to Munnar from there. I am just confused on taking which route is good and give scenery places while travelling up hill.\n\n\nAlso, I am planning to going to Meeshapuli mala trek and if anyone already been there or if anyone planning to going there, please suggest with any trek organising group.\n\nThanks in advance.",
    "created_at": "2025-07-16T12:50:25+00:00",
    "source": "reddit",
    "location": "Chennai, Tamil Nadu",
    "url": "https://reddit.com/r/Chennai/comments/1m1br49/chennai_to_munnar_travel_via_public_transport/",
    "score": 0,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.09999999999999999,
      "label": "neutral",
      "confidence": 0.6
    },
    "transport_type": "bus",
    "state": "Tamil Nadu"
  },
  {
    "id": "reddit_comment_n3fwdnz",
    "text": "Not sure about any direct buses from Chennai, if not....go to Theni and there are a lot of buses to Munnar",
    "created_at": "2025-07-16T13:14:33+00:00",
    "source": "reddit_comment",
    "location": "Chennai, Tamil Nadu",
    "url": "https://reddit.com/r/Chennai/comments/1m1br49/chennai_to_munnar_travel_via_public_transport/",
    "score": 5,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": -0.075,
      "label": "neutral",
      "confidence": 0.575
    },
    "transport_type": "bus",
    "state": "Tamil Nadu"
  },
  {
    "id": "reddit_comment_n3ft84e",
    "text": "There’s a direct bus from kcbt to munnar operated by tnstc . You could try that",
    "created_at": "2025-07-16T12:56:53+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m1br49/chennai_to_munnar_travel_via_public_transport/",
    "score": 1,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.1,
      "label": "neutral",
      "confidence": 0.6
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3golt1",
    "text": "Direct bus available \nOr via Theni is good",
    "created_at": "2025-07-16T15:32:54+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Chennai/comments/1m1br49/chennai_to_munnar_travel_via_public_transport/",
    "score": 1,
    "subreddit": "chennai",
    "sentiment": {
      "polarity": 0.39999999999999997,
      "label": "positive",
      "confidence": 0.8999999999999999
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m15sbv",
    "text": "Scammer in Kolkata Metro This dude sitting next to me in Metro while I was travelling from rabindra sadan to netaji at 9:15 am, tried discreetly taking pictures of my whatsApp msg which I had just opened, there was a picture of my pan card, I confronted him, he simply denied. I was short on time and wasn't 100% sure if he did click pictures, but looking back he definitely did. Now I am in a constant state of anxiety not knowing if my pan details will be misused. If anyone comes across him somehow pls try to get ahold of his no. ",
    "created_at": "2025-07-16T06:56:22+00:00",
    "source": "reddit",
    "location": "Kolkata, West Bengal",
    "url": "https://reddit.com/r/kolkata/comments/1m15sbv/scammer_in_kolkata_metro/",
    "score": 127,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.07142857142857142,
      "label": "neutral",
      "confidence": 0.5714285714285714
    },
    "transport_type": "metro",
    "state": "West Bengal"
  },
  {
    "id": "reddit_comment_n3enk4y",
    "text": "Metro in dino on next level",
    "created_at": "2025-07-16T07:17:52+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m15sbv/scammer_in_kolkata_metro/",
    "score": 45,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eo08y",
    "text": "Thank you for posting this, I hope you catch him. But you don't have to be anxious. Even though PAN card info is sensitive, there's not much he'll be able to do without OTPs, signature, bank account details and many other things. \n\nBut to be safe, you should keep an eye out on your cibil report for the next few months. Look out for any soft/hard enquiries that might be made or any loans sanctioned on your name. Both of these are very long shots and practically impossible without other details but look out for them and flag them to cibil if you see any",
    "created_at": "2025-07-16T07:22:03+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m15sbv/scammer_in_kolkata_metro/",
    "score": 24,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": -0.05287878787878788,
      "label": "neutral",
      "confidence": 0.5528787878787879
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ep8r2",
    "text": "Nothing’s gonna happen. Using your pan he hardly get much detials about you. For any other thing he needs otp linked to the pan number’s phone",
    "created_at": "2025-07-16T07:33:41+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m15sbv/scammer_in_kolkata_metro/",
    "score": 7,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": -0.07222222222222223,
      "label": "neutral",
      "confidence": 0.5722222222222222
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1kgs0",
    "text": "Can anyone tell me how to reach ISI Kolkata from Thakurpukur via bus without taking any metro route? Plz",
    "created_at": "2025-07-16T18:28:53+00:00",
    "source": "reddit",
    "location": "Kolkata, West Bengal",
    "url": "https://reddit.com/r/kolkata/comments/1m1kgs0/can_anyone_tell_me_how_to_reach_isi_kolkata_from/",
    "score": 2,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "West Bengal"
  },
  {
    "id": "reddit_1m17z7e",
    "text": "Want to quit my job and start a business — need advice 🙏 Hi everyone,\n\nI’ve been working in IT for the last 5 years, but now I’m planning to quit my job and start a small-scale manufacturing business.\n\nI have around ₹10-15 lakhs left as my total savings, and I’m seriously considering starting an ice cream manufacturing unit.\n\nBut I have some concerns.\n\nThe market already has big players like AMUL, Kwality Walls, Mother Dairy, and Metro, which makes me wonder — would people even try a new brand? Or do most of you always prefer established brands when it comes to ice cream?\n\nThis is a do-or-die move for me. I can’t afford to fail, so I really need your honest thoughts:\n\nWould you try ice cream from a new local brand?\n\nDo you think this business idea makes sense, or should I consider something else?\n\nAny other small-scale manufacturing ideas that could work with this budget?\n\nIs anyone here already running an ice cream manufacturing unit and doing well? I'd love to hear your experience.\n\n\nAny advice, suggestions, or even harsh truths are welcome.\nThanks in advance 🙏",
    "created_at": "2025-07-16T09:20:02+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m17z7e/want_to_quit_my_job_and_start_a_business_need/",
    "score": 87,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.10635521885521886,
      "label": "positive",
      "confidence": 0.6063552188552188
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3faz1v",
    "text": "Go with kulfi, many small businesses making kulfi, rabri kulfi in Ujjain are successful. Also we don't have any kulfi oriented chain in WB",
    "created_at": "2025-07-16T10:56:01+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m17z7e/want_to_quit_my_job_and_start_a_business_need/",
    "score": 10,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.3333333333333333,
      "label": "positive",
      "confidence": 0.8333333333333333
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fcr2l",
    "text": "Check out “home bakery” model and start small first. You can keep home-made ice-creams, desserts, or keto/healthy/high-protein meal subscription which are uncommon in Kolkata. (i’ve seen some people getting success with small home-attached stores and tie-up with Zomato/Swiggy). Experiment with the tastes and see customer acceptance before going all-in with manufacturing unit since this is a do-or-die moment. Later on, you can niche down into ice-cream manufacturing if that’s what you enjoy.",
    "created_at": "2025-07-16T11:09:41+00:00",
    "source": "reddit_comment",
    "location": "Kolkata, West Bengal",
    "url": "https://reddit.com/r/kolkata/comments/1m17z7e/want_to_quit_my_job_and_start_a_business_need/",
    "score": 8,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.13680555555555557,
      "label": "positive",
      "confidence": 0.6368055555555556
    },
    "transport_type": "bus",
    "state": "West Bengal"
  },
  {
    "id": "reddit_comment_n3f19g4",
    "text": "Dada if u can create daav icecream  it would be good, my whole family likes it but it's not easily available in bengal,some company do sell it but the quality is too bad.so the suggestion is start manufacturing daav icecream and do not compromise the quality plz",
    "created_at": "2025-07-16T09:30:19+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/kolkata/comments/1m17z7e/want_to_quit_my_job_and_start_a_business_need/",
    "score": 12,
    "subreddit": "kolkata",
    "sentiment": {
      "polarity": 0.2333333333333333,
      "label": "positive",
      "confidence": 0.7333333333333333
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1cweb",
    "text": "New in Hyderabad, where can i find vegetable fruit, chicken egg market, like places where i can get groceries for cheap.I live near madhapur metro, any idea and recommendation would be helpfull. ",
    "created_at": "2025-07-16T13:41:24+00:00",
    "source": "reddit",
    "location": "Hyderabad, Telangana",
    "url": "https://reddit.com/r/hyderabad/comments/1m1cweb/new_in_hyderabad_where_can_i_find_vegetable_fruit/",
    "score": 1,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": -0.056818181818181816,
      "label": "neutral",
      "confidence": 0.5568181818181818
    },
    "transport_type": "metro",
    "state": "Telangana"
  },
  {
    "id": "reddit_comment_n3g3ig4",
    "text": "Star bazar in Kondapur.",
    "created_at": "2025-07-16T13:52:38+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1cweb/new_in_hyderabad_where_can_i_find_vegetable_fruit/",
    "score": 1,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g6erx",
    "text": "Bro ask local shopkeepers when weekly or biweekly market in the neighborhood happens. It happens in each neighborhood atleast once a week.",
    "created_at": "2025-07-16T14:07:25+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1cweb/new_in_hyderabad_where_can_i_find_vegetable_fruit/",
    "score": 1,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_1m13hqh",
    "text": "Why were traffic lights suddenly installed at Myhome Avatar after 2 years of smooth flow? Hey everyone, I’m hoping someone can shed some light on this: the Hyderabad Traffic Police just put up traffic signals at the entrance to Myhome Avatar—something that wasn’t there for the past two years, despite low traffic volumes. Since the lights went live:\n\n* My round‑trip commute between Narsingi and the ORR has **increased by about 10 minutes**.\n* **From the Narsingi side:** It’s a two‑lane road, and roughly half the vehicles turn left into the complex. Yet we now sit through a full **2 min red**, even though left turns used to flow freely without any stops.\n* **From the ORR side:** You’d expect a “free” right turn, but there’s another **2 min red** before you can turn in. Visibility and conflict levels here haven’t changed, yet the wait is now mandatory.\n\nIt honestly feels like a solution to a problem that never existed—and it’s adding unnecessary delays for everyone. Has anyone heard why this signal was deemed necessary? Are there accident stats or traffic studies that justified it? If you’re dealing with the same frustration, what do you think would be a good compromise (e.g., dedicated arrow phases, sensor‑activated greens)?\n\nWould love to hear your thoughts or any insider info! 🙏🏻🚦  \n— A fed‑up daily commuter in Hyderabad",
    "created_at": "2025-07-16T04:34:18+00:00",
    "source": "reddit",
    "location": "Hyderabad, Telangana",
    "url": "https://reddit.com/r/hyderabad/comments/1m13hqh/why_were_traffic_lights_suddenly_installed_at/",
    "score": 1,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.14918380230880232,
      "label": "positive",
      "confidence": 0.6491838023088023
    },
    "transport_type": "bus",
    "state": "Telangana"
  },
  {
    "id": "reddit_comment_n3e6jve",
    "text": "Isn't that the whole purpose of traffic police here? Disrupt things that work well",
    "created_at": "2025-07-16T04:48:02+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m13hqh/why_were_traffic_lights_suddenly_installed_at/",
    "score": 7,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.2,
      "label": "positive",
      "confidence": 0.7
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3e7c0p",
    "text": "This was expected ...once more towers open for residents and more buildings are made ..its gonna be very crowded road  with unlimited traffic jams ..\n\nWhen ORR opened ..all service roads near gachibowli to Narsingi were bi directional with out medians ..no medians are built ..service roads are expanded to 4 lanes ....once Kokapet n Neopolis towers ,and Manikonda towers neae lanco open .. this are going to get even worse ..",
    "created_at": "2025-07-16T04:55:08+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m13hqh/why_were_traffic_lights_suddenly_installed_at/",
    "score": 2,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.10000000000000002,
      "label": "positive",
      "confidence": 0.6
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ede8o",
    "text": "Just travel 2 minutes earlier or later. \n\nJokes aside, I think they don’t have enough manpower and use signals and barriers and dividers and rumble strips and other shitty fixes to solve whatever they’re blamed for. So even if they see overspeeding by 5% of the population, they put one of these things to slow all 100% to a crawl.",
    "created_at": "2025-07-16T05:47:02+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m13hqh/why_were_traffic_lights_suddenly_installed_at/",
    "score": 1,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": -0.085,
      "label": "neutral",
      "confidence": 0.585
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1dmi8",
    "text": "Wtf is wrong with men and what are other men around doing. I was dropping my girlfriend today at metro and a random group of basti boys were there as soon as she saw them she went silent. I started asking her whats wrong and all then she tells me what happened. She told me that  when she was waiting for her driver to pick her up near nagole metro, a drunk guy was there. He started staring at her and going around her while touching his dick. This might sound not so bad to the guys reading this but this actually traumatises women. This is not okay. \nShe was just blank- she didnt know what to do maybe if her driver was a little late we wouldnt know what would happen. So please if you see anything happening around a woman and she feels uncomfortable please step up. \nThis is the least you can do. ",
    "created_at": "2025-07-16T14:11:34+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1dmi8/wtf_is_wrong_with_men_and_what_are_other_men/",
    "score": 312,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": -0.2145833333333333,
      "label": "negative",
      "confidence": 0.7145833333333333
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gah77",
    "text": "I have heard from my colleagues at work, Gachibowli MMTS station entrance is so dark at entrance that many of them got touched and blatantly groped while entering. One of my colleagues got groped at 11 am by passing auto driver. SHE team was demonstrating her that she should walk on the right side of the road and not on left. They just kept begging to delete the tweet which was tweeted tagging them. No action only victim blaming. In this country you’re on your own.",
    "created_at": "2025-07-16T14:27:22+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1dmi8/wtf_is_wrong_with_men_and_what_are_other_men/",
    "score": 106,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": 0.06785714285714285,
      "label": "neutral",
      "confidence": 0.5678571428571428
    },
    "transport_type": "auto",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g87tt",
    "text": "I'm a man and I don't think this is ok , people need to start taking action when they see something that's wrong . But what to say , a very few of them have the mentality to protect",
    "created_at": "2025-07-16T14:16:25+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1dmi8/wtf_is_wrong_with_men_and_what_are_other_men/",
    "score": 117,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": -0.04000000000000001,
      "label": "neutral",
      "confidence": 0.54
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gcmi0",
    "text": ">This might not sound so bad to guys\n\nIt DOES sound bad and it's disgusting to the core.\n\nBut the question is, how many of men actually do something about it when they see this IRL.",
    "created_at": "2025-07-16T14:37:37+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/hyderabad/comments/1m1dmi8/wtf_is_wrong_with_men_and_what_are_other_men/",
    "score": 19,
    "subreddit": "hyderabad",
    "sentiment": {
      "polarity": -0.24285714285714283,
      "label": "negative",
      "confidence": 0.7428571428571429
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1h116",
    "text": "Is Pune Losing Its IT Charm Over Bad Roads and Traffic? Many IT companies in Pune are considering relocating or have already planned to move out due to the poor road conditions and worsening traffic. Specially Hinjewadi roads need special attention  & Traffic issues in Pune City.\nWhat are your thoughts on this? ",
    "created_at": "2025-07-16T16:21:11+00:00",
    "source": "reddit",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1h116/is_pune_losing_its_it_charm_over_bad_roads_and/",
    "score": 57,
    "subreddit": "pune",
    "sentiment": {
      "polarity": -0.001785714285714261,
      "label": "neutral",
      "confidence": 0.5017857142857143
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3h1ozi",
    "text": "Hinjewadi is gone case. Just Wipro and Infosys are surviving there because they have invested lots of money for the campus. Even Infosys have started their second GCC at Kharadi. Ask any IT employee about new walk-in or hiring emails. Everything is happening only for Hyderabad or Bangalore. Even Noida is picking up the pace nowadays. \n\nPune has lost its shine. HYD is new silicon valley now.",
    "created_at": "2025-07-16T16:56:30+00:00",
    "source": "reddit_comment",
    "location": "Bangalore, Karnataka",
    "url": "https://reddit.com/r/pune/comments/1m1h116/is_pune_losing_its_it_charm_over_bad_roads_and/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.06818181818181818,
      "label": "neutral",
      "confidence": 0.5681818181818181
    },
    "transport_type": "bus",
    "state": "Karnataka"
  },
  {
    "id": "reddit_comment_n3gvqnx",
    "text": "These asshole corporations and politicians think Pune's gaining crowd it's in demand so no need to develop as people will keep coming they just eating the money not Pune , india is doomed .\n\n\nSee US , things are distributed see other countries things are distributed in india there are few cities where everyone wants to come which creates bad population .\n\nMumbai crowd is coming to pune hyderebad bengluru they think pune is peaceful .. just see the mundhwa bridge and other roads ..\n\nIt's a fact that in the upcoming years Pune's crowd will increase very much despite of small sized roads crowded highways we are seeing right now too",
    "created_at": "2025-07-16T16:28:14+00:00",
    "source": "reddit_comment",
    "location": "Mumbai, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1h116/is_pune_losing_its_it_charm_over_bad_roads_and/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": -0.0449206349206349,
      "label": "neutral",
      "confidence": 0.5449206349206349
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3gzibz",
    "text": "They are ruining Kharadi now.",
    "created_at": "2025-07-16T16:46:32+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/pune/comments/1m1h116/is_pune_losing_its_it_charm_over_bad_roads_and/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1e8k7",
    "text": "Anyone know why some of these trains leave from SVJR instead of Pune? Makes no sense with so many people commuting from and to pune...",
    "created_at": "2025-07-16T14:36:21+00:00",
    "source": "reddit",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1e8k7/anyone_know_why_some_of_these_trains_leave_from/",
    "score": 16,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.5,
      "label": "positive",
      "confidence": 1.0
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3ggsei",
    "text": "Pune station is very busy handling express trains so they are now developing nearby stations like Shivajinagar, Hadapsar and Khadki to decongest Pune Station.",
    "created_at": "2025-07-16T14:57:03+00:00",
    "source": "reddit_comment",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1e8k7/anyone_know_why_some_of_these_trains_leave_from/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.13,
      "label": "positive",
      "confidence": 0.63
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3gd3ul",
    "text": "Pune station is already busy with long route trains, Suburban trains may not get platform, so they are already trying to decongest Pune station, and it is also easy to travel from Shivajinagar as it has 2 platforms only",
    "created_at": "2025-07-16T14:39:55+00:00",
    "source": "reddit_comment",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1e8k7/anyone_know_why_some_of_these_trains_leave_from/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.09666666666666666,
      "label": "neutral",
      "confidence": 0.5966666666666667
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3gi39f",
    "text": "Pune Station is already busy with long distance trains, so suburban trains may not get the platform, so some trains leave Shivaji Nagar instead of Pune junction",
    "created_at": "2025-07-16T15:03:04+00:00",
    "source": "reddit_comment",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m1e8k7/anyone_know_why_some_of_these_trains_leave_from/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.016666666666666666,
      "label": "neutral",
      "confidence": 0.5166666666666667
    },
    "transport_type": "train",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_1m19hwz",
    "text": "Pune — I love you, but what’s happening to you? I’ve lived in Pune all my life. I’m Puneri mulgi by heart. But something about the city’s vibe has changed lately. especially post Covid and honestly, I’m heartbroken.\n\nThe traffic is beyond chaotic. The amount of road rage, impatience, and plain rudeness is something else. And it’s not just about cars, I can’t walk peacefully on the footpath without constantly watching my back because two-wheelers now seem to think pavements are fair game. And if I dare say anything or even make eye contact? I get sworn at. What is going on?\n\nIf I’m driving and someone’s randomly walking/ standing in the middle of the road and I honk they swear. If I’m walking and someone’s driving recklessly, they still swear. The aggression is so unprovoked and so unnecessary.\n\nRickshawalaas have become incredibly rude too. Not all, of course, but the overall experience is just… horrible. \n\nAnd as a woman even if I’m wearing full clothes and a scarf, I’ve noticed how men still stare. It’s so dehumanising. Why?\n\nAnd then there’s the bigger picture — the scary stuff. The Porsche case. The physical assault of journalist Sneha Barve. How normalized drugs have become. The rise in gundagiri. The corruption. The horrifying civic sense. It all feels like a ticking time bomb.\n\nI’m not exaggerating when I say I feel scared. Like truly scared. That I can walk out of my house and — due to someone else’s ego, rage, or carelessness — I could get seriously injured or worse.\n\nAnd let’s not even start on the roads.\n\nNow there’s a language war brewing too. Marathi is my mother tongue, I speak it fluently and proudly. But beating people up over language? Forcing it down someone’s throat? That’s not the Pune I know. That’s not the Maharashtra I love.\n\nIt just sucks. I never thought I’d say this, but the city I love feels like it’s slipping away into something darker, more violent, and more apathetic.\n\nI really hope something changes. Because right now, it’s painful to watch what Pune is becoming.",
    "created_at": "2025-07-16T10:55:21+00:00",
    "source": "reddit",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m19hwz/pune_i_love_you_but_whats_happening_to_you/",
    "score": 212,
    "subreddit": "pune",
    "sentiment": {
      "polarity": -0.027568342151675505,
      "label": "neutral",
      "confidence": 0.5275683421516755
    },
    "transport_type": "auto",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_comment_n3fbvxc",
    "text": "It happens when a city does not plan for population explosion",
    "created_at": "2025-07-16T11:03:03+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/pune/comments/1m19hwz/pune_i_love_you_but_whats_happening_to_you/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fd0pt",
    "text": "Policing has in general degraded after covid",
    "created_at": "2025-07-16T11:11:41+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/pune/comments/1m19hwz/pune_i_love_you_but_whats_happening_to_you/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.05000000000000002,
      "label": "neutral",
      "confidence": 0.55
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fbkke",
    "text": "I have been in Pune for a decade now and I agree that the condition of the city has noticeably worsened.",
    "created_at": "2025-07-16T11:00:37+00:00",
    "source": "reddit_comment",
    "location": "Pune, Maharashtra",
    "url": "https://reddit.com/r/pune/comments/1m19hwz/pune_i_love_you_but_whats_happening_to_you/",
    "score": 1,
    "subreddit": "pune",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "reddit_1m1k4wh",
    "text": "The conductor doesn't ask me for the bus fare So I travel from AMTS from my college to home , it takes me 6 minutes to reach home , I have been travelling in AMTS for the past two days and the bus conductor doesn't ask for the bus fare . Do I have to ask him for the ticket?? . Im really confused",
    "created_at": "2025-07-16T18:16:29+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m1k4wh/the_conductor_doesnt_ask_me_for_the_bus_fare/",
    "score": 3,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": -0.325,
      "label": "negative",
      "confidence": 0.825
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3hyzah",
    "text": ">Do I have to ask him for the ticket??\n\nBilkul pucho bhai. Kya pata kal ho na ho.",
    "created_at": "2025-07-16T19:28:17+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m1k4wh/the_conductor_doesnt_ask_me_for_the_bus_fare/",
    "score": 2,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ima4p",
    "text": "if u wanna spend money then yeah , else no",
    "created_at": "2025-07-16T21:15:32+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m1k4wh/the_conductor_doesnt_ask_me_for_the_bus_fare/",
    "score": 1,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m15jxv",
    "text": "Garbage collector in Ahmedabad refused to take diaper waste because of “abhadchhath” — Welcome to 2025 So here’s something that really blew my mind today.\n\nI threw out my baby’s used diapers in a black garbage bag (standard stuff, right?). The garbage collector came, looked at the bag like it was nuclear waste, and refused to take it. Why? Because he’s a “Mataji na bhuva” and can’t touch anything that includes female sanitary products or diapers — due to “abhadchhath.”\n\nYep. You heard that right.\n\nApparently, women’s hygiene products and baby diapers are spiritually untouchable, even if they’re sealed in a garbage bag and being picked up as literal trash.\n\nBut here’s the irony: when it’s time to get intimate or have kids, no one seems to have a problem with women then. Love them for sex, for babies, for cooking, for culture — but suddenly when it’s time to deal with their actual bodily functions, it’s “too impure”?\nWhat kind of fragile spirituality is this?\n\nThis isn’t just about one guy. It’s about a bigger issue:\n👉 Why do we allow religion or superstition to override basic sanitation?\n👉 Why isn’t there proper training or regulation for waste management?\n👉 Why is society still shaming women through backdoor channels like this?\n\nWe live in 2025. We’re talking about AI, space travel, and sustainability, and yet… basic garbage collection in a major Indian city still bows down to regressive beliefs.\n\nI’m honestly sad for my motherland. We deserve better — especially the women who carry this country on their backs while being treated like they’re made of filth.\n\nIs this a common issue in Ahmedabad? How do people usually deal with sanitary/diaper waste?\n\nCurious (and a bit furious).",
    "created_at": "2025-07-16T06:41:18+00:00",
    "source": "reddit",
    "location": "Ahmedabad, Gujarat",
    "url": "https://reddit.com/r/ahmedabad/comments/1m15jxv/garbage_collector_in_ahmedabad_refused_to_take/",
    "score": 99,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.03597264663441133,
      "label": "neutral",
      "confidence": 0.5359726466344114
    },
    "transport_type": "train",
    "state": "Gujarat"
  },
  {
    "id": "reddit_comment_n3ek4xz",
    "text": "It sounds…..I started it but couldn’t figure out how to describe.\nIs there any way to complain to AMC?",
    "created_at": "2025-07-16T06:46:49+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m15jxv/garbage_collector_in_ahmedabad_refused_to_take/",
    "score": 24,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ejtxs",
    "text": "Hearing this problem for the first time! Strange",
    "created_at": "2025-07-16T06:44:06+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m15jxv/garbage_collector_in_ahmedabad_refused_to_take/",
    "score": 26,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.13125,
      "label": "positive",
      "confidence": 0.63125
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3epns9",
    "text": "Swatch Bharat....\n\nYeah, but first educate the garbage collectors and tell them to collect the garbage no matter what day of the year it is\n\nAs for Complaint Number for AMC - 155303",
    "created_at": "2025-07-16T07:37:38+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m15jxv/garbage_collector_in_ahmedabad_refused_to_take/",
    "score": 10,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": -0.024999999999999994,
      "label": "neutral",
      "confidence": 0.525
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1b13a",
    "text": "Travel to Shankeshwar I am planning to visit Shankeshwar. So we get bus transport from Ahmedabad towards Shankeshwar and vice versa? Heard from few people that there is no transport available towards Shankeshwar, however online travel agencies show GSRTC buses from Ahmedabad. ",
    "created_at": "2025-07-16T12:16:19+00:00",
    "source": "reddit",
    "location": "Ahmedabad, Gujarat",
    "url": "https://reddit.com/r/ahmedabad/comments/1m1b13a/travel_to_shankeshwar/",
    "score": 1,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.1,
      "label": "neutral",
      "confidence": 0.6
    },
    "transport_type": "bus",
    "state": "Gujarat"
  },
  {
    "id": "reddit_comment_n3fos70",
    "text": "There r buses from geetamandir bus station.",
    "created_at": "2025-07-16T12:30:51+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/ahmedabad/comments/1m1b13a/travel_to_shankeshwar/",
    "score": 1,
    "subreddit": "ahmedabad",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m1d3r5",
    "text": "I Lost my Father — And the Hospital Walked Away Without Accountability. EHCC-Jaipur Earlier this year, my father traveled from our hometown to Jaipur for a Total Knee Replacement (TKR). As someone who had undergone an open-heart bypass (CABG) surgery in 2015, I was cautious about every step of this medical process. I live in Hyderabad and flew down to Jaipur to personally help him select a multi-speciality hospital—one that could manage complications if they arose.\n\nMy father, a strong and hopeful man, travelled overnight by bus to Jaipur. The orthopedic surgeon examined him and confirmed he was fit for TKR—but as a standard procedure due to his past CABG, we were advised to get a cardiac clearance.\n\nWe got a DSE (Dobutamine Stress Echo) test done. The results showed some abnormalities, and the cardiologist suggested an angiography. But I was wary. Big hospitals often push for stent placements even when unnecessary. I requested a few days to think it over, but the hospital insisted it be done the same day.\n\nI decided to consult other doctors I trusted. After multiple opinions, we chose to get a CT-Angio at EHCC Hospital, a reputed facility in Jaipur. I personally asked the cardiologist there—**twice**—whether this would be safe, given my father’s history. He gave us **200% assurance**.\n\nWe proceeded with both CT-Angio and then the conventional angiography. My father was admitted and prepared for the procedure. He was absolutely fine, joking, chatting, and looking forward to getting better soon.\n\nDuring the angiography, the doctor showed me a live screen and explained that while the main artery looked fine, there was a 90% blockage in a secondary artery. He recommended a stent. Trusting his earlier assurances, I agreed.\n\nThe procedure was declared a success. The doctor congratulated us, and I was allowed to meet my father in the ICU. He was cheerful and said, *“I didn’t even feel anything—it was so quick!”* We spoke for 20 minutes and began planning for discharge.\n\nLater, I left the hospital briefly. Then came the call that changed everything.\n\nThe hospital asked me to return urgently. Alarmed, I called back and demanded to know what had happened. Their first question was, *“Did you give him any blood pressure medicine?”* I was furious. He was in their ICU—**they** were responsible for all medication.\n\nI rushed back, only to be told that my father had suffered a **brain hemorrhage**—caused by blood thinners administered after the angioplasty. A neurosurgeon had been brought in, and they now needed to perform emergency brain surgery.\n\nI was devastated. Just hours earlier, he was smiling and joking. Now, they were saying it was a matter of life and death.\n\nDespite multiple surgeries over the next few days, **my father did not survive**.\n\nWe are shattered. The trauma has left my family in pieces. What hurts most is the way the hospital handled it all—rushing into procedures, pushing decisions, and then absolving themselves when things went horribly wrong.\n\nYes, we signed consent forms. Yes, they are legally covered. But what about **accountability**? What about the human side of healthcare? What about families who lose loved ones due to medical negligence masked as protocol?\n\nWe are still in shock. And while we may never get justice through the courts, I am using this platform to speak up—for my father, and for the countless others who may silently suffer similar fates.\n\nSince this incident, I’ve personally advised many people to **stay away from that hospital**, and I will **keep warning others**. This is the least I can do for my father, and for the families who still believe hospitals are always a safe space.\n\n**Please share this. Let’s not normalize blind trust in the Hospital/Doctor. Ask questions. Get second opinions. And most importantly—hold people accountable.**\n\n",
    "created_at": "2025-07-16T13:50:18+00:00",
    "source": "reddit",
    "location": "Hyderabad, Telangana",
    "url": "https://reddit.com/r/jaipur/comments/1m1d3r5/i_lost_my_father_and_the_hospital_walked_away/",
    "score": 97,
    "subreddit": "jaipur",
    "sentiment": {
      "polarity": 0.06506848530658055,
      "label": "neutral",
      "confidence": 0.5650684853065806
    },
    "transport_type": "taxi",
    "state": "Telangana"
  },
  {
    "id": "reddit_comment_n3g552n",
    "text": "So sorry to hear this story OP, more power to you.\nBut doctors from such big hospitals usually do push unnecessary stents insertion even where they are not required, witnessed a lot of cases like this.",
    "created_at": "2025-07-16T14:00:54+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/jaipur/comments/1m1d3r5/i_lost_my_father_and_the_hospital_walked_away/",
    "score": 17,
    "subreddit": "jaipur",
    "sentiment": {
      "polarity": -0.10833333333333334,
      "label": "negative",
      "confidence": 0.6083333333333334
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3g599g",
    "text": "Thank you for sharing. sorry about your loss.\n\nHospital nurse left a stitch during stitches removal from an ACL surgery I had. It gave me an infection and caused complications in my recovery. So yeah true that hospitals shouldn't be given blind trust.",
    "created_at": "2025-07-16T14:01:30+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/jaipur/comments/1m1d3r5/i_lost_my_father_and_the_hospital_walked_away/",
    "score": 11,
    "subreddit": "jaipur",
    "sentiment": {
      "polarity": -0.1625,
      "label": "negative",
      "confidence": 0.6625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3gcsj8",
    "text": "sorry for your loss, lost my uncle after the doctors did angioplasty, he never gained consciousness again. This happened at Manipal hospital Jaipur on 12th of July. I don’t think these doctors care one bit about people, we are just business props to them.",
    "created_at": "2025-07-16T14:38:25+00:00",
    "source": "reddit_comment",
    "location": "Jaipur, Rajasthan",
    "url": "https://reddit.com/r/jaipur/comments/1m1d3r5/i_lost_my_father_and_the_hospital_walked_away/",
    "score": 5,
    "subreddit": "jaipur",
    "sentiment": {
      "polarity": -0.5,
      "label": "negative",
      "confidence": 1.0
    },
    "transport_type": "bus",
    "state": "Rajasthan"
  },
  {
    "id": "reddit_1m17dnq",
    "text": "Ye kya chal raha hai hamari rajdhani me 💔 I saw this underpass full of muddy water in which a poor child was bathing and swimming. The water was so contaminated and was there for days, the kid will definitely get infected with some disease.\n\nLocals are not able to use this underpass and both side traffic is going from the same side underpass.\n\nNo body cares about middle class & infrastructure in India. You are on your own !!",
    "created_at": "2025-07-16T08:40:16+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m17dnq/ye_kya_chal_raha_hai_hamari_rajdhani_me/",
    "score": 129,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.09107142857142857,
      "label": "neutral",
      "confidence": 0.5910714285714286
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eytr0",
    "text": "3rd cleanest city, my ass.",
    "created_at": "2025-07-16T09:06:40+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m17dnq/ye_kya_chal_raha_hai_hamari_rajdhani_me/",
    "score": 34,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ez8np",
    "text": "Bhai kisi Charbagh wala underpass dekha hai railway wala jaha side me car washing ki shop hai kkc k samne? ...mai ek baar waha barish me gya tha us k niche bahut pani bhar gya tha aor naale ka ganda paani bhi mixed tha usme...usme 7-8 ldke aise hi kar rhe the",
    "created_at": "2025-07-16T09:10:39+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m17dnq/ye_kya_chal_raha_hai_hamari_rajdhani_me/",
    "score": 11,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3f46sc",
    "text": "Har underpass swimming pool yozana",
    "created_at": "2025-07-16T09:57:42+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m17dnq/ye_kya_chal_raha_hai_hamari_rajdhani_me/",
    "score": 6,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m11q7b",
    "text": "Kothi Gulistan e Iram ",
    "created_at": "2025-07-16T03:02:08+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m11q7b/kothi_gulistan_e_iram/",
    "score": 20,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fqdzg",
    "text": "Next to the district court? Is it?",
    "created_at": "2025-07-16T12:40:32+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m11q7b/kothi_gulistan_e_iram/",
    "score": 2,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3drs6w",
    "text": "Lying near Qaisberbagh ~1 km from KD Singh Babu Metro Station, the second building is in a dilapidated state. [Second Image](https://i.ibb.co/BHQVLSzh/Kothi-Gulistan-e-Haram-1.jpg)",
    "created_at": "2025-07-16T03:03:47+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/lucknow/comments/1m11q7b/kothi_gulistan_e_iram/",
    "score": 1,
    "subreddit": "lucknow",
    "sentiment": {
      "polarity": 0.03333333333333333,
      "label": "neutral",
      "confidence": 0.5333333333333333
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_1m1ae81",
    "text": "KSRTC launched open top double decker bus in kochi ",
    "created_at": "2025-07-16T11:44:16+00:00",
    "source": "reddit",
    "location": "Kochi, Kerala",
    "url": "https://reddit.com/r/Kochi/comments/1m1ae81/ksrtc_launched_open_top_double_decker_bus_in_kochi/",
    "score": 293,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.16666666666666666,
      "label": "positive",
      "confidence": 0.6666666666666666
    },
    "transport_type": "bus",
    "state": "Kerala"
  },
  {
    "id": "reddit_comment_n3fln5u",
    "text": "https://i.redd.it/5shcwmgf98df1.gif",
    "created_at": "2025-07-16T12:11:14+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m1ae81/ksrtc_launched_open_top_double_decker_bus_in_kochi/",
    "score": 23,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3fl0c9",
    "text": "Seems like they built it to last just about 6 months.  തട്ടിക്കുട്ട് feels.",
    "created_at": "2025-07-16T12:07:12+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m1ae81/ksrtc_launched_open_top_double_decker_bus_in_kochi/",
    "score": 36,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m15yt5",
    "text": "How to reach edappally from nettoor Hi kochikkaare, I am coming to Kochi for my education so as the title suggests I would like to know how to reach edappally from Nettoor and vice versa , are direct buses available between nettoor and edappally all the time?? Also how much time would it usually take to reach edappally.\nAlso how to reach nettoor from vyttila hub which bus route to take??\nP.s edappally bus st George pallide frontil koode povvo???",
    "created_at": "2025-07-16T07:07:39+00:00",
    "source": "reddit",
    "location": "Kochi, Kerala",
    "url": "https://reddit.com/r/Kochi/comments/1m15yt5/how_to_reach_edappally_from_nettoor/",
    "score": 3,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.11249999999999999,
      "label": "positive",
      "confidence": 0.6125
    },
    "transport_type": "bus",
    "state": "Kerala"
  },
  {
    "id": "reddit_comment_n3ensp5",
    "text": "Both private and ksrtc buses are there to edapally and vice versa",
    "created_at": "2025-07-16T07:20:06+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m15yt5/how_to_reach_edappally_from_nettoor/",
    "score": 3,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3f6ksh",
    "text": "There are direct busses to edappally available which have stops at nettoor(both intuc jn and palli stop) at morning ( 7 to 9 window). But not sure of the exact time.",
    "created_at": "2025-07-16T10:19:11+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m15yt5/how_to_reach_edappally_from_nettoor/",
    "score": 3,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.125,
      "label": "positive",
      "confidence": 0.625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eo6ro",
    "text": "By Bus and Metro from Vytila is an option. Usually takes 30 - 45 min.",
    "created_at": "2025-07-16T07:23:44+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m15yt5/how_to_reach_edappally_from_nettoor/",
    "score": 2,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": -0.25,
      "label": "negative",
      "confidence": 0.75
    },
    "transport_type": "metro",
    "state": "India"
  },
  {
    "id": "reddit_1m149o9",
    "text": "Travelling to kochi for the first time Hi all, i am travelling to kochi for the first time to meet a friend. However, I will have a few days free. Please suggest some good places that capture the essence of kochi, considering the weather too. \nWould you suggest going to varkala as a quick weekend trip? \n",
    "created_at": "2025-07-16T05:22:16+00:00",
    "source": "reddit",
    "location": "Kochi, Kerala",
    "url": "https://reddit.com/r/Kochi/comments/1m149o9/travelling_to_kochi_for_the_first_time/",
    "score": 4,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.28888888888888886,
      "label": "positive",
      "confidence": 0.7888888888888889
    },
    "transport_type": "bus",
    "state": "Kerala"
  },
  {
    "id": "reddit_comment_n3epn4d",
    "text": "Nothing would be fun in this weather. It's raining all the time.",
    "created_at": "2025-07-16T07:37:28+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m149o9/travelling_to_kochi_for_the_first_time/",
    "score": 1,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.3,
      "label": "positive",
      "confidence": 0.8
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3esvq0",
    "text": "Please search the sub. There are these kinds of queries every other day here ...",
    "created_at": "2025-07-16T08:08:27+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/Kochi/comments/1m149o9/travelling_to_kochi_for_the_first_time/",
    "score": 1,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": -0.125,
      "label": "negative",
      "confidence": 0.625
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3eypfg",
    "text": "If you love activities then there a kayaking place at kayakingkochi at Kadamakudy known as Secret routes kayaking. infact its the best thing to do it in this climate also\n\n[https://www.instagram.com/secretrouteskayaking?igsh=Mzh0c2ttbmY1cXhl&utm\\_source=qr](https://www.instagram.com/secretrouteskayaking?igsh=Mzh0c2ttbmY1cXhl&utm_source=qr)",
    "created_at": "2025-07-16T09:05:30+00:00",
    "source": "reddit_comment",
    "location": "Kochi, Kerala",
    "url": "https://reddit.com/r/Kochi/comments/1m149o9/travelling_to_kochi_for_the_first_time/",
    "score": 1,
    "subreddit": "kochi",
    "sentiment": {
      "polarity": 0.3666666666666667,
      "label": "positive",
      "confidence": 0.8666666666666667
    },
    "transport_type": "bus",
    "state": "Kerala"
  },
  {
    "id": "reddit_1m132n0",
    "text": "Overcrowded Local Train in Bhagpat, UP ",
    "created_at": "2025-07-16T04:10:41+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m132n0/overcrowded_local_train_in_bhagpat_up/",
    "score": 578,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3e5cxw",
    "text": "idk why railway does not run usual suburban EMU type trains here, usually suburban emus are broader and have more number of coaches",
    "created_at": "2025-07-16T04:37:30+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m132n0/overcrowded_local_train_in_bhagpat_up/",
    "score": 73,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.0625,
      "label": "neutral",
      "confidence": 0.5625
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3e6p01",
    "text": "I believe this is partly due to lack of such trains. I mean we definitely have overall shortage, but this area is in the national capital region sandwiched between the trunk routes of Delhi-Ambala and Delhi-Haridwar, but now has a single electrified route. I think people want more connectivity from areas like Baghpat, Shamli etc. to Delhi. For cities like Delhi, with the population it has and in the NCR, we need a few more radial routes and some encircling routes too. For reference we can check how Delhi metro is laid out. Most of the routes are radial lines running roughly the straight line and then we have two circular lines - Pink and Magenta. IR needs to have something similar around Delhi.",
    "created_at": "2025-07-16T04:49:18+00:00",
    "source": "reddit_comment",
    "location": "Delhi",
    "url": "https://reddit.com/r/indianrailways/comments/1m132n0/overcrowded_local_train_in_bhagpat_up/",
    "score": 16,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.05650510204081634,
      "label": "neutral",
      "confidence": 0.5565051020408164
    },
    "transport_type": "metro",
    "state": "Delhi"
  },
  {
    "id": "reddit_comment_n3e5krd",
    "text": "Indian squad game is way more difficult to movie game",
    "created_at": "2025-07-16T04:39:23+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m132n0/overcrowded_local_train_in_bhagpat_up/",
    "score": 16,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": -0.2,
      "label": "negative",
      "confidence": 0.7
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_1m13upm",
    "text": "Wanted to go to Ghaziabad but booked a train that doesn’t stop there… what should I do? Well, I wanted to go to Ghaziabad(UP) from Howrah station, but because of the similar train names I got nervous and ended up booking a different one that doesn’t even stop at Ghaziabad. It’s really frustrating me 😭.\nI actually wanted to take the Bikaner SF Weekly Express, but I mistakenly booked the Bikaner SF Express. I was planning to take the Netaji Express, but my brother was telling me to take the morning one so that the work would get done quickly and I could reach the next day.\nNow I don’t know what to do 😭. Please help me!\n\n\nI'm 18M and now I'm afraid 🥲. It's Tatkal Ticket so cancelling will not help ",
    "created_at": "2025-07-16T04:57:32+00:00",
    "source": "reddit",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m13upm/wanted_to_go_to_ghaziabad_but_booked_a_train_that/",
    "score": 27,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": -0.09523809523809525,
      "label": "neutral",
      "confidence": 0.5952380952380952
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3e8f2a",
    "text": "1. Get down at the nearest station of Ghaziabad and use any other means of transport.\n\n2. Pull the chain at ghaziabad\n\n3. Jump at ghaziabad\n\nChoose any one",
    "created_at": "2025-07-16T05:04:52+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m13upm/wanted_to_go_to_ghaziabad_but_booked_a_train_that/",
    "score": 43,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": -0.14027777777777778,
      "label": "negative",
      "confidence": 0.6402777777777777
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3ean1o",
    "text": "Get down at Kanpur central or Etawah and take swarn shatabdi it reaches ghaziabad at 9:38 PM",
    "created_at": "2025-07-16T05:23:26+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m13upm/wanted_to_go_to_ghaziabad_but_booked_a_train_that/",
    "score": 8,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": -0.07777777777777778,
      "label": "neutral",
      "confidence": 0.5777777777777777
    },
    "transport_type": "bus",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3e8i2o",
    "text": "Cancel and book another ticket. No good connections available from Tundla/Agra as the train touches there in the evening.",
    "created_at": "2025-07-16T05:05:33+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m13upm/wanted_to_go_to_ghaziabad_but_booked_a_train_that/",
    "score": 11,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.025000000000000022,
      "label": "neutral",
      "confidence": 0.525
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_1m1iguz",
    "text": "Created Passing Train routes mapper for any given station code. Hi guys, I've created this website to display the map of all the routes of the trains which pass through your given train station.\n\nhttp://13.61.27.152:5000/\n\nJust enter your station code in the box and submit.\n\nIt was useful for me as when i was staying in Hyderabad I was looking for routes from my hometown in Uttarakhand (small station) a direct train which reaches closest to Hyderabad. And I found the bengaluru special train which goes till Warangal. It really helped me when I had huge luggage.\n\nYou can give your feedback please.\n\n\nExample: \nhttps://postimg.cc/YLtnzVcz",
    "created_at": "2025-07-16T17:14:22+00:00",
    "source": "reddit",
    "location": "Bangalore, Karnataka",
    "url": "https://reddit.com/r/indianrailways/comments/1m1iguz/created_passing_train_routes_mapper_for_any_given/",
    "score": 11,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.1845238095238095,
      "label": "positive",
      "confidence": 0.6845238095238095
    },
    "transport_type": "train",
    "state": "Karnataka"
  },
  {
    "id": "reddit_comment_n3h7zbh",
    "text": "That's a nice project. Good job!\n\nIn the train list, you could also mention the _time_ at which the corresponding train will reach the queried station. If possible you can then further incorporate NTES/WIMT to include realtime information and the actual time it would reach accounting for any delays",
    "created_at": "2025-07-16T17:24:48+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m1iguz/created_passing_train_routes_mapper_for_any_given/",
    "score": 3,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.29500000000000004,
      "label": "positive",
      "confidence": 0.795
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3h8elf",
    "text": "are there any public apis which provide infos of the railways ?",
    "created_at": "2025-07-16T17:26:41+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m1iguz/created_passing_train_routes_mapper_for_any_given/",
    "score": 3,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "reddit_comment_n3h8pg9",
    "text": "IRI already has this feature as does confirmtkt. \n\nWhat everyone lacks is an effective \"chain\" feature . For e.g\nbetween Haridwar and Secenderabad there is only one train listed viz. YNRK/YPR spl. But via NDLS there can be many choices. IRI offers it but in a confusing way.",
    "created_at": "2025-07-16T17:28:02+00:00",
    "source": "reddit_comment",
    "location": "India",
    "url": "https://reddit.com/r/indianrailways/comments/1m1iguz/created_passing_train_routes_mapper_for_any_given/",
    "score": 2,
    "subreddit": "IndianRailways",
    "sentiment": {
      "polarity": 0.18000000000000002,
      "label": "positive",
      "confidence": 0.68
    },
    "transport_type": "train",
    "state": "India"
  },
  {
    "id": "web_-2378711856155890222",
    "text": "mumbai traffic",
    "created_at": "2025-07-16T21:33:22.280440+00:00",
    "source": "web_scraping",
    "location": "Mumbai, Maharashtra",
    "url": "https://www.hindustantimes.com/topic/mumbai-traffic",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "web_3135838517598362447",
    "text": "Latest from mumbai traffic",
    "created_at": "2025-07-16T21:33:22.280440+00:00",
    "source": "web_scraping",
    "location": "Mumbai, Maharashtra",
    "url": "https://www.hindustantimes.com/topic/mumbai-traffic",
    "sentiment": {
      "polarity": 0.5,
      "label": "positive",
      "confidence": 1.0
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "web_7056949110207136846",
    "text": "Traffic police acquire 43 cranes to ease traffic",
    "created_at": "2025-07-16T21:33:22.280440+00:00",
    "source": "web_scraping",
    "location": "Mumbai, Maharashtra",
    "url": "https://www.hindustantimes.com/topic/mumbai-traffic",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "web_63289916342584846",
    "text": "PM Modi in Navi Mumbai today: Traffic advisory issued. Avoid these routes",
    "created_at": "2025-07-16T21:33:22.280440+00:00",
    "source": "web_scraping",
    "location": "Mumbai, Maharashtra",
    "url": "https://www.hindustantimes.com/topic/mumbai-traffic",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "bus",
    "state": "Maharashtra"
  },
  {
    "id": "web_-8448081309269021471",
    "text": "DMRC",
    "created_at": "2025-07-16T21:33:24.748112+00:00",
    "source": "web_scraping",
    "location": "Delhi",
    "url": "https://timesofindia.indiatimes.com/topic/delhi-metro",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "Delhi"
  },
  {
    "id": "web_-1834246205700798205",
    "text": "delhi metro News",
    "created_at": "2025-07-16T21:33:24.748112+00:00",
    "source": "web_scraping",
    "location": "Delhi",
    "url": "https://timesofindia.indiatimes.com/topic/delhi-metro",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "Delhi"
  },
  {
    "id": "web_-2380586253343612216",
    "text": "delhi metro Photos",
    "created_at": "2025-07-16T21:33:24.748112+00:00",
    "source": "web_scraping",
    "location": "Delhi",
    "url": "https://timesofindia.indiatimes.com/topic/delhi-metro",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "Delhi"
  },
  {
    "id": "web_2266965638440110852",
    "text": "delhi metro Videos",
    "created_at": "2025-07-16T21:33:24.748112+00:00",
    "source": "web_scraping",
    "location": "Delhi",
    "url": "https://timesofindia.indiatimes.com/topic/delhi-metro",
    "sentiment": {
      "polarity": 0.0,
      "label": "neutral",
      "confidence": 0.5
    },
    "transport_type": "metro",
    "state": "Delhi"
  }
]